Documents/ПродажаАбонемента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ПродажаАбонемента</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Абонемент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Абонементы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Абонементы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаПродажи</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Стоимость</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СпособОплаты</Name>
      <ValueType><v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыАбонементаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыАбонементаКлиента</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Активен</Name>
    </Value>
    <Value>
      <Name>Заморожен</Name>
    </Value>
    <Value>
      <Name>Закончился</Name>
    </Value>
    <Value>
      <Name>Истёк</Name>
    </Value>
    <Value>
      <Name>Отменён</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/ВидыОперацийОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>ВидыОперацийОплат</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>ПокупкаАбонемента</Name>
    </Value>
    <Value>
      <Name>РазовоеЗанятие</Name>
    </Value>
    <Value>
      <Name>Продление</Name>
    </Value>
    <Value>
      <Name>ДополнительнаяУслуга</Name>
    </Value>
    <Value>
      <Name>Возврат</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Оплата</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОплаты</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Сумма</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СпособОплаты</Name>
      <ValueType><v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.СпособыОплаты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Назначение</Name>
      <ValueType><v8:Type>cfg:EnumRef.ВидыОперацийОплат</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ВидыОперацийОплат</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Абонемент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Catalogs/АбонементыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>АбонементыКлиента</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВидАбонемента</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Абонементы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Абонементы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаПокупки</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачалаДействия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>КоличествоЗанятий</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Использовано</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Заморожено</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>10</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ПроданоПоДокументу</Name>
      <ValueType><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Documents/ПродажаАбонемента/Ext/ObjectModule.bsl
// Модуль документа Продажа абонемента

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Создание абонемента клиента
	НовыйАбонемент = Справочники.АбонементыКлиента.СоздатьЭлемент();
	НовыйАбонемент.Наименование = Строка(Клиент) + " / " + Строка(Абонемент);
	НовыйАбонемент.Клиент = Клиент;
	НовыйАбонемент.ВидАбонемента = Абонемент;
	НовыйАбонемент.ДатаПокупки = ТекущаяДата();
	НовыйАбонемент.ДатаНачалаДействия = ДатаНачала;
	НовыйАбонемент.ДатаОкончания = ДатаОкончания;
	НовыйАбонемент.КоличествоЗанятий = Абонемент.КоличествоЗанятий;
	НовыйАбонемент.Использовано = 0;
	НовыйАбонемент.Статус = Перечисления.СтатусыАбонементаКлиента.Активен;
	НовыйАбонемент.ПроданоПоДокументу = Ссылка;
	НовыйАбонемент.Записать();

	// Зачисление занятий на баланс абонемента (движение Приход по регистру ОстаткиАбонементов)
	ДвиженияОстатки = Новый Массив;
	ДвижениеОстатки = Новый Структура("ВидДвижения, АбонементКлиента, КоличествоЗанятий");
	ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеОстатки.АбонементКлиента = НовыйАбонемент.Ссылка;
	ДвижениеОстатки.КоличествоЗанятий = Абонемент.КоличествоЗанятий;
	ДвиженияОстатки.Добавить(ДвижениеОстатки);
	РаботаСОстаткамиАбонементов.ЗаписатьДвиженияОстатки(Ссылка, Дата, ДвиженияОстатки);

	// Регистрация оплаты
	Оплата = Документы.Оплата.СоздатьДокумент();
	Оплата.Дата = ТекущаяДата();
	Оплата.Клиент = Клиент;
	Оплата.Сумма = Стоимость;
	Оплата.СпособОплаты = СпособОплаты;
	Оплата.Назначение = Перечисления.ВидыОперацийОплат.ПокупкаАбонемента;
	Оплата.Абонемент = НовыйАбонемент.Ссылка;
	Оплата.Записать(РежимЗаписиДокумента.Проведение);

	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Продажа абонемента", "", Строка(Абонемент) + ", сумма=" + Строка(Стоимость));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(Клиент) Тогда
		Сообщить("Не заполнен клиент");
		Отказ = Истина;
	КонецЕсли;
	Если ПустоеЗначение(Абонемент) Тогда
		Сообщить("Не выбран вид абонемента");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
